app/controllers/comment_controller.rb

	def create
		@content_id = params[:content_id]
		if current_user
			@user_id = current_user.id
			@body = params[:body]
			@comment = Comment.new(content_id: @content_id, user_id: @user_id, body: @body)
			@comment.save
---
INSERT INTO `comments` (`content_id`, `user_id`, `body`, `created_at`, `updated_at`) VALUES (1, 1, 'HOLI', '2015-11-02 06:59:34', '2015-11-02 06:59:34')
INSERT INTO `contents` (`name`, `year`, `description`, `poster`, `trailer`, `score`, `country`, `created_at`, `updated_at`) VALUES ('The Avengers', 2014, 'Movie of the Avengers', '/poster/avengers.jpg', '/trailer/avengers.mp4', 50.0, 'United States of America', '2015-11-02 07:02:23', '2015-11-02 07:02:23')