app/controllers/favorite_controller.rb

	def create
		@content_id = params[:content_id]
		if current_user
			@user_id  = current_user.id
			@favorite = Favorite.where(user_id: @user_id, content_id: @content_id)
			if @favorite.blank?
				@favorite = Favorite.new(user_id: @user_id, content_id: @content_id)
				@favorite.save
---
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 1 AND `favorites`.`content_id` = 1
INSERT INTO `favorites` (`user_id`, `content_id`, `created_at`, `updated_at`) VALUES (1, 1, '2015-11-02 07:13:10', '2015-11-02 07:13:10')