app/controllers/profile_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	def show
		@user = User.find(params["id"])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	def edit
		@user = User.find(params["id"])