app/controllers/review_controller.rb

	def create
		@content_id = params[:content_id]
		if current_user
			@user_id = current_user.id
			@body = params[:body]
			@score = params[:score]
			@review = Review.new(content_id: @content_id, user_id: @user_id, body: @body, score: @score)
			@review.save
---
INSERT INTO `reviews` (`content_id`, `user_id`, `body`, `score`, `created_at`, `updated_at`) VALUES (1, 1, 'AUSDYGAUSDBASIDHNABSIDHNASIDHNASIDHANISDH', 50.0, '2015-11-02 07:24:44', '2015-11-02 07:24:44')